Repository: flexiant/ocfs2-tools
Catalog: debian/po/*.po
Languages: pt

source: Would you like to start an OCFS2 cluster (O2CB) at boot time?
pt: Deseja iniciar o cluster OCFS2 (O2CB) durante o arranque do sistema?

source: Name of the cluster to start at boot time:
pt: Nome do cluster a iniciar durante o arranque do sistema:

source: O2CB heartbeat threshold:
pt: Limite de "batimento cardíaco" do O2CB:

source: The O2CB heartbeat threshold sets up the maximum time in seconds that a node awaits for an I/O operation. After it, the node "fences" itself, and you will probably see a crash.
pt: O limite de "batimento cardíaco" do O2CB define o tempo máximo em segundos em que um 'node' espera por uma operação de I/O. Após este tempo, o 'node' "fecha-se sobre ele próprio" e provavelmente verá um crash.

source: It is calculated as the result of: (threshold - 1) x 2.
pt: Está calculado como o resultado de:(limite - 1) x 2.

source: Its default value is 31 (60 seconds).
pt: O valor por omissão é de 31 (60 segundos).

source: Raise it if you have slow disks and/or crashes with kernel messages like:
pt: Aumente o valor se tiver discos lentos e/ou 'crashes' com mensagens do kernel como:

source: O2CB idle timeout:
pt: Tempo limite de inactividade do O2CB:

source: The O2CB idle timeout (expressed in milliseconds) is the time before a network connection is considered dead.
pt: O tempo limite de inactividade do O2CB (expresso em milissegundos) corresponde ao tempo antes do qual uma ligação de rede é considerada inactiva.

source: Its default value is 30000 (30 seconds) and the minimum recommended value is 5000 (5 seconds).
pt: O valor predefinido é de 30000 (30 segundos) e o valor mínimo recomendado de 5000 (5 segundos).

source: O2CB keepalive delay:
pt: Atraso de manutenção da ligação O2CB:

source: The O2CB keepalive delay (expressed in milliseconds) is the maximum time before a keepalive packet is sent.
pt: O atraso de manutenção da ligação (expresso em milissegundos) corresponde ao tempo máximo antes do qual um pacote de manutenção da ligação é enviado.

source: Its default value is 2000 (2 seconds) and the minimum recommended value is 1000 (1 second).
pt: O valor predefinido é de 2000 (2 segundos) e o valor mínimo recomendado de 1000 (1 segundos).

source: O2CB reconnect delay:
pt: Atraso de re-ligação O2CB:

source: The O2CB reconnect delay (expressed in milliseconds) is the minimum time between connection attempts.
pt: O atraso de re-ligação (expresso em milissegundos) corresponde ao tempo mínimo entre tentativas de ligação.

source: Its default and recommended minimum value is 2000 (2 seconds).
pt: O valor predefinido e mínimo recomendado é de 2000 (2 segundos).
